# Pandas – zadania

Na podstawie poniższego dataframe'a wykonaj zadania

Czas: 25 minut

In [1]:
import pandas as pd
import numpy as np 

dict_ = {"id": list(range(1, 9)), 
         "name": ["Alice", "Bob", None, "Dereck", "Elizabeth", "Frank", "George", np.nan],
         "date_of_birth": ["1991-10-13", "2004-04-02", "", "", "", "1999-04-05", "", "1984-08-11"],
         "n_of_points": [20, 23, 11, 40, 54, 29, 31, 20]}
df = pd.DataFrame(dict_)
df["date_of_birth"] = pd.to_datetime(df["date_of_birth"])

In [2]:
df

   id       name date_of_birth  n_of_points
0   1      Alice    1991-10-13           20
1   2        Bob    2004-04-02           23
2   3       None           NaT           11
3   4     Dereck           NaT           40
4   5  Elizabeth           NaT           54
5   6      Frank    1999-04-05           29
6   7     George           NaT           31
7   8        NaN    1984-08-11           20

1. Sprawdź ile kolumn i wierszy ma dataframe

In [3]:
df.shape

(8, 4)

2. Sprawdź jakie są typy danych w poszczególnych kolumnach. Zrób to na dwa sposoby: klasycznie oraz z wykorzystaniem pętli `for`

In [4]:
df.dtypes

id                        int64
name                     object
date_of_birth    datetime64[ns]
n_of_points               int64
dtype: object

In [6]:
for colname, col in df.iteritems():
    print(col.dtype)

int64
object
datetime64[ns]
int64

3. Wywołaj na obiekcie df metodę, która pokaże informacje o typach kolumn, wartościach brakujących oraz pamięci zajmowanej przez obiekt

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             8 non-null      int64
 1   name           6 non-null      object
 2   date_of_birth  4 non-null      datetime64[ns]
 3   n_of_points    8 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 384.0+ bytes

4. Utwórz dataframe, który zawiera kolumny "name" oraz "n_of_points" z wyjściowego dataframe'a

In [ ]:
df[["name", "n_of_points"]]

        name  n_of_points
0      Alice           20
1        Bob           23
2       None           11
3     Dereck           40
4  Elizabeth           54
5      Frank           29
6     George           31
7        NaN           20

5. Sprawdź jaka wartość jest w kolumnie "date_of_birth" dla indeksu df-a równego 5

In [ ]:
df["date_of_birth"].iloc[5]

Timestamp('1999-04-05 00:00:00')

6. Sprawdź ile unikalnych wartości jest w poszczególnych kolumnach

In [27]:
def valcounts(col):
    return col.unique()

In [15]:
df.apply(valcounts, axis=0)

<bound method DataFrame.value_counts of    id       name date_of_birth  n_of_points
0   1      Alice    1991-10-13           20
1   2        Bob    2004-04-02           23
2   3       None           NaT           11
3   4     Dereck           NaT           40
4   5  Elizabeth           NaT           54
5   6      Frank    1999-04-05           29
6   7     George           NaT           31
7   8        NaN    1984-08-11           20>

7. Wyciągnij cały wiersz z dataframe'a dla osoby o imieniu "Dereck"

In [40]:
df[df["name"] == "Dereck"]

   id    name date_of_birth  n_of_points
3   4  Dereck           NaT           40

8. Wyciągnij informacje o wszystkich osobach, które mają mniej punktów niż 30

In [39]:
df[df["n_of_points"] < 30]

   id   name date_of_birth  n_of_points
0   1  Alice    1991-10-13           20
1   2    Bob    2004-04-02           23
2   3   None           NaT           11
5   6  Frank    1999-04-05           29
7   8    NaN    1984-08-11           20

9. Utwórz nową kolumnę, której wartości będą wyglądały w następujący sposób: `<NAME>__<N_OF_POINTS>`

In [46]:
df["name"]

0        Alice
1          Bob
2         None
3       Dereck
4    Elizabeth
5        Frank
6       George
7          NaN
Name: name, dtype: object

In [48]:
df["n_of_points"].astype(object)

0    20
1    23
2    11
3    40
4    54
5    29
6    31
7    20
Name: n_of_points, dtype: object

In [52]:
df["<NAME>__<N_OF_POINTS>"] = "<" + df["name"] + ">__<" + df["n_of_points"].astype('string') + ">"
df

   id       name date_of_birth  n_of_points <NAME>__<N_OF_POINTS>
0   1      Alice    1991-10-13           20         <Alice>__<20>
1   2        Bob    2004-04-02           23           <Bob>__<23>
2   3       None           NaT           11                  <NA>
3   4     Dereck           NaT           40        <Dereck>__<40>
4   5  Elizabeth           NaT           54     <Elizabeth>__<54>
5   6      Frank    1999-04-05           29         <Frank>__<29>
6   7     George           NaT           31        <George>__<31>
7   8        NaN    1984-08-11           20                  <NA>

10. Policz średnią punktów wszystkich osób

In [58]:
df["n_of_points"].mean()

28.5

11. Zamień wszystkie brakujące wartości na napis "brak danych"

In [60]:
df.fillna("brak danych", inplace=True)
df

   id         name        date_of_birth  n_of_points <NAME>__<N_OF_POINTS>
0   1        Alice  1991-10-13 00:00:00           20         <Alice>__<20>
1   2          Bob  2004-04-02 00:00:00           23           <Bob>__<23>
2   3  brak danych          brak danych           11           brak danych
3   4       Dereck          brak danych           40        <Dereck>__<40>
4   5    Elizabeth          brak danych           54     <Elizabeth>__<54>
5   6        Frank  1999-04-05 00:00:00           29         <Frank>__<29>
6   7       George          brak danych           31        <George>__<31>
7   8  brak danych  1984-08-11 00:00:00           20           brak danych

12. Posortuj wiersze według malejącej liczby punktów

In [61]:
df.sort_values("n_of_points", ascending=False)

   id         name        date_of_birth  n_of_points <NAME>__<N_OF_POINTS>
4   5    Elizabeth          brak danych           54     <Elizabeth>__<54>
3   4       Dereck          brak danych           40        <Dereck>__<40>
6   7       George          brak danych           31        <George>__<31>
5   6        Frank  1999-04-05 00:00:00           29         <Frank>__<29>
1   2          Bob  2004-04-02 00:00:00           23           <Bob>__<23>
0   1        Alice  1991-10-13 00:00:00           20         <Alice>__<20>
7   8  brak danych  1984-08-11 00:00:00           20           brak danych
2   3  brak danych          brak danych           11           brak danych